In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.isnull()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [5]:
df.isna()

       A      B      C
0  False  False  False
1  False   True  False
2   True   True  False

In [6]:
df.isnull().sum()

A    1
B    2
C    0
dtype: int64

In [7]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [10]:
df.dropna() #-----by default it will drops all the rows consisting of null values

     A    B  C
0  1.0  5.0  1

In [11]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [12]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [16]:
df.dropna(thresh=2) #Keep only the rows which have atleast 2 non nan values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [17]:
df.fillna(value="Fill value")

            A           B  C
0           1           5  1
1           2  Fill value  2
2  Fill value  Fill value  3

In [18]:
df.mean()

A    1.5
B    5.0
C    2.0
dtype: float64

In [22]:
mean=df["A"].mean()
mean

1.5

In [21]:
df["A"].fillna(mean)

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [23]:
df['A'].fillna(value=df['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [24]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [25]:
df=pd.DataFrame(data)

In [26]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [27]:
df.groupby('Company')

In [29]:
df.groupby('Company')['Sales'].mean()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [30]:
df.groupby('Company')['Sales'].median()

Company
FB      296.5
GOOG    160.0
MSFT    232.0
Name: Sales, dtype: float64

In [31]:
df.groupby('Company')['Sales'].sum()

Company
FB      593
GOOG    320
MSFT    464
Name: Sales, dtype: int64

In [32]:
df.groupby('Company')['Sales'].count()

Company
FB      2
GOOG    2
MSFT    2
Name: Sales, dtype: int64

In [33]:
df.groupby(['Company','Person'])['Sales'].sum()

Company  Person
FB       Carl       243
         Sarah      350
GOOG     Charlie    120
         Sam        200
MSFT     Amy        340
         Vanessa    124
Name: Sales, dtype: int64

In [34]:
by_comp = df.groupby("Company")

In [35]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [37]:
by_comp["Sales"].std()

Company
FB       75.660426
GOOG     56.568542
MSFT    152.735065
Name: Sales, dtype: float64

In [38]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [39]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [40]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [43]:
#unique----returns unique values
df['col2'].unique()

array([444, 555, 666], dtype=int64)

In [44]:
df['col2'].nunique()

3

In [45]:
df['col2'].value_counts() #no.of time a particular element is occuring in a column

444    2
555    1
666    1
Name: col2, dtype: int64

In [50]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [51]:
df[(df['col1']>=2) &(df['col2']>444)]

   col1  col2 col3
1     2   555  def
2     3   666  ghi

# Applying Function

In [54]:
def times2(x):
    return x*2

In [55]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [56]:
df['col1'].apply(lambda x:x*2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64